Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_INPUTMUX0.h
#define INPUTMUX0_SCT0_TRIG_TRIGIN_MASK          (0x1FU)
#define INPUTMUX0_SCT0_TRIG_TRIGIN_SHIFT         (0U)
/*! TRIGIN - SCT0 Input Trigger
 *  0b00000..Selects SCT0_GPIN0
 *  0b00001..Selects SCT0_GPIN1
 *  0b00010..Selects SCT0_GPIN2
 *  0b00011..Selects SCT0_GPIN3
 *  0b00100..Selects SCT0_GPIN4
 *  0b00101..Selects SCT0_GPIN5
 *  0b00110..Selects SCT0_GPIN6
 *  0b00111..Selects SCT0_GPIN7
 *  0b01000..Selects CTIMER0_MAT0
 *  0b01001..Selects CTIMER1_MAT0
 *  0b01010..Selects CTIMER2_MAT0
 *  0b01011..Selects CTIMER3_MAT0
 *  0b01100..Selects CTIMER4_MAT0
 *  0b01101..Selects USB1 start of frame
 *  0b01110..Selects PINT0 boolean pattern-match output
 *  0b01111..Selects USB0 start of frame
 *  0b10000..Selects ACMP0 CMPO
 *  0b10001..Selects SAI0_TX_BCLK
 *  0b10010..Selects SAI0_RX_BCLK
 *  0b10011..Selects SAI1_TX_BCLK
 *  0b10100..Selects SAI1_RX_BCLK
 *  0b10101..Selects SAI2_TX_BCLK
 *  0b10110..Selects SAI2_RX_BCLK
 *  0b10111..Selects MCLK
 *  0b11000..Selects CPU0 TXEV
 *  0b11001..Selects CPU0 Halted
 *  0b11010..Selects ADC0 trigger completion flag 0
 *  0b11011..Selects ADC0 trigger completion flag 1
 */
#define INPUTMUX0_SCT0_TRIG_TRIGIN(x)            (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_SCT0_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_SCT0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name PINT0_TRIG - PINT0 Input Connections */
/*! @{ */

#define INPUTMUX0_PINT0_TRIG_TRIGIN_MASK         (0x3FU)
#define INPUTMUX0_PINT0_TRIG_TRIGIN_SHIFT        (0U)
/*! TRIGIN - PINT0 Input Trigger
 *  0b000000..Selects PIO0_0
 *  0b000001..Selects PIO0_1
 *  0b000010..Selects PIO0_2
 *  0b000011..Selects PIO0_3
 *  0b000100..Selects PIO0_4
 *  0b000101..Selects PIO0_5
 *  0b000110..Selects PIO0_6
 *  0b000111..Selects PIO0_7
 *  0b001000..Selects PIO0_8
 *  0b001001..Selects PIO0_9
 *  0b001010..Selects PIO0_10
 *  0b001011..Selects PIO0_11
 *  0b001100..Selects PIO0_12
 *  0b001101..Selects PIO0_13
 *  0b001110..Selects PIO0_14
 *  0b001111..Selects PIO0_15
 *  0b010000..Selects PIO0_16
 *  0b010001..Selects PIO0_17
 *  0b010010..Selects PIO0_18
 *  0b010011..Selects PIO0_19
 *  0b010100..Selects PIO0_20
 *  0b010101..Selects PIO0_21
 *  0b010110..Selects PIO0_22
 *  0b010111..Selects PIO0_23
 *  0b011000..Selects PIO0_24
 *  0b011001..Selects PIO0_25
 *  0b011010..Selects PIO0_26
 *  0b011011..Selects PIO0_27
 *  0b011100..Selects PIO0_28
 *  0b011101..Selects PIO0_29
 *  0b011110..Selects PIO0_30
 *  0b011111..Selects PIO0_31
 *  0b100000..Selects PIO1_0
 *  0b100001..Selects PIO1_1
 *  0b100010..Selects PIO1_2
 *  0b100011..Selects PIO1_3
 *  0b100100..Selects PIO1_4
 *  0b100101..Selects PIO1_5
 *  0b100110..Selects PIO1_6
 *  0b100111..Selects PIO1_7
 *  0b101000..Selects PIO1_8
 *  0b101001..Selects PIO1_9
 *  0b101010..Selects PIO1_10
 *  0b101011..Selects PIO1_11
 *  0b101100..Selects PIO1_12
 *  0b101101..Selects PIO1_13
 *  0b101110..Selects PIO1_14
 *  0b101111..Selects PIO1_15
 *  0b110000..Selects PIO1_16
 *  0b110001..Selects PIO1_17
 *  0b110010..Selects PIO1_18
 *  0b110011..Selects PIO1_19
 */
#define INPUTMUX0_PINT0_TRIG_TRIGIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_PINT0_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_PINT0_TRIG_TRIGIN_MASK)
/*! @} */

/*! @name HIFI4_INTERRUPT - HiFi4 Interrupt Connections */
/*! @{ */

#define INPUTMUX0_HIFI4_INTERRUPT_TRIGIN_MASK    (0x7FU)
#define INPUTMUX0_HIFI4_INTERRUPT_TRIGIN_SHIFT   (0U)
/*! TRIGIN - HiFi4 Input Interrupt
 *  0b0000000..Selects LP_FLEXCOMM0 interrupt
 *  0b0000001..Selects LP_FLEXCOMM1 interrupt
 *  0b0000010..Selects LP_FLEXCOMM2 interrupt
 *  0b0000011..Selects LP_FLEXCOMM3 interrupt
 *  0b0000100..Selects LP_FLEXCOMM4 interrupt
 *  0b0000101..Selects LP_FLEXCOMM5 interrupt
 *  0b0000110..Selects LP_FLEXCOMM6 interrupt
 *  0b0000111..Selects LP_FLEXCOMM7 interrupt
 *  0b0001000..Selects LP_FLEXCOMM8 interrupt
 *  0b0001001..Selects LP_FLEXCOMM9 interrupt
 *  0b0001010..Selects LP_FLEXCOMM10 interrupt
 *  0b0001011..Selects LP_FLEXCOMM11 interrupt
 *  0b0001100..Selects LP_FLEXCOMM12 interrupt
 *  0b0001101..Selects LP_FLEXCOMM13 interrupt
 *  0b0001110..Selects MU2_MUA interrupt for HiFi4 to CPU1
 *  0b0001111..Selects MU4_MUB interrupt for HiFi4 to CPU0
 *  0b0010000..Selects WWDT0 interrupt
 *  0b0010001..Selects WWDT1 interrupt
 *  0b0010010..Selects UTICK0 interrupt
 *  0b0010011..Selects LPSPI14 interrupt
 *  0b0010100..Selects MRT0 Ored interrupt
 *  0b0010101..Selects OSTIMER event timer for HiFi4 wakeup/interrupt
 *  0b0010110..Selects CTIMER0 interrupt
 *  0b0010111..Selects CTIMER1 interrupt
 *  0b0011000..Selects CTIMER2 interrupt
 *  0b0011001..Selects CTIMER3 interrupt
 *  0b0011010..Selects CTIMER4 interrupt
 *  0b0011011..Selects RTC0 alarm interrupt to computer domain
 *  0b0011100..Selects RTC_SS0 wakeup interrupt to compute domain
 *  0b0011101..Selects I3C0 interrupt
 *  0b0011110..Selects I3C1 interrupt
 *  0b0011111..Selects MICFIL interrupt for read data or error
 *  0b0100000..Selects MICFIL hardware voice activity detector interrupt or error interrupt
 *  0b0100001..Selects LCDIF interrupt
 *  0b0100010..Selects VGPU interrupt from graphics core (domain HCLK)
 *  0b0100011..Selects EZH-V interrupt
 *  0b0100100..Selects FLEXIO interrupt
 *  0b0100101..Selects LPSPI16 interrupt
 *  0b0100110..Selects eDMA0 channel 0 interrupt
 *  0b0100111..Selects eDMA0 channel 1 interrupt
 *  0b0101000..Selects eDMA0 channel 2 interrupt
 *  0b0101001..Selects eDMA0 channel 3 interrupt
 *  0b0101010..Selects eDMA0 channel 4 interrupt
 *  0b0101011..Selects eDMA0 channel 5 interrupt
 *  0b0101100..Selects eDMA0 channel 6 interrupt
 *  0b0101101..Selects eDMA0 channel 7 interrupt
 *  0b0101110..Selects eDMA0 channel 8 interrupt
 *  0b0101111..Selects eDMA0 channel 9 interrupt
 *  0b0110000..Selects eDMA0 channel 10 interrupt
 *  0b0110001..Selects eDMA0 channel 11 interrupt
 *  0b0110010..Selects eDMA0 channel 12 interrupt
 *  0b0110011..Selects eDMA0 channel 13 interrupt
 *  0b0110100..Selects eDMA0 channel 14 interrupt
 *  0b0110101..Selects eDMA0 channel 15 interrupt
 *  0b0110110..Selects eDMA1 channel 0 interrupt
 *  0b0110111..Selects eDMA1 channel 1 interrupt
 *  0b0111000..Selects eDMA1 channel 2 interrupt
 *  0b0111001..Selects eDMA1 channel 3 interrupt
 *  0b0111010..Selects eDMA1 channel 4 interrupt
 *  0b0111011..Selects eDMA1 channel 5 interrupt
 *  0b0111100..Selects eDMA1 channel 6 interrupt
 *  0b0111101..Selects eDMA1 channel 7 interrupt
 *  0b0111110..Selects eDMA1 channel 8 interrupt
 *  0b0111111..Selects eDMA1 channel 9 interrupt
 *  0b1000000..Selects eDMA1 channel 10 interrupt
 *  0b1000001..Selects eDMA1 channel 11 interrupt
 *  0b1000010..Selects eDMA1 channel 12 interrupt
 *  0b1000011..Selects eDMA1 channel 13 interrupt
 *  0b1000100..Selects eDMA1 channel 14 interrupt
 *  0b1000101..Selects eDMA1 channel 15 interrupt
 *  0b1000110..Selects GPIO0 channel 0 interrupt
 *  0b1000111..Selects GPIO0 channel 1 interrupt
 *  0b1001000..Selects GPIO1 channel 0 interrupt
 *  0b1001001..Selects GPIO1 channel 1 interrupt
 *  0b1001010..Selects GPIO2 channel 0 interrupt
 *  0b1001011..Selects GPIO2 channel 1 interrupt
 *  0b1001100..Selects GPIO3 channel 0 interrupt
 *  0b1001101..Selects GPIO3 channel 1 interrupt
 *  0b1001110..Selects GPIO4 channel 0 interrupt
 *  0b1001111..Selects GPIO4 channel 1 interrupt
 *  0b1010000..Selects GPIO5 channel 0 interrupt
 *  0b1010001..Selects GPIO5 channel 1 interrupt
 *  0b1010010..Selects GPIO6 channel 0 interrupt
 *  0b1010011..Selects GPIO6 channel 1 interrupt
 *  0b1010100..Selects GPIO7 channel 0 interrupt
 *  0b1010101..Selects GPIO7 channel 1 interrupt
 *  0b1010110..Selects PINT0 interrupt 0
 *  0b1010111..Selects PINT0 interrupt 1
 *  0b1011000..Selects PINT0 interrupt 2
 *  0b1011001..Selects PINT0 interrupt 3
 *  0b1011010..Selects PINT0 interrupt 4
 *  0b1011011..Selects PINT0 interrupt 5
 *  0b1011100..Selects PINT0 interrupt 6
 *  0b1011101..Selects PINT0 interrupt 7
 *  0b1011110..Selects SAI0 TX/RX interrupt
 *  0b1011111..Selects SAI1 TX/RX interrupt
 *  0b1100000..Selects SAI2 TX/RX interrupt
 *  0b1100010..Selects XSPI0 Ored interrupt and flash error interrupt.
 *  0b1100011..Selects XSPI1 Ored interrupt and flash error interrupt.
 *  0b1100100..Selects XSPI2 Ored interrupt and flash error interrupt.
 *  0b1100101..Selects JPGDECWRP Ored context 0-3 interrupt
 *  0b1100110..Selects PNGDEC interrupt
 *  0b1100111..Selects NPU interrupt
 *  0b1101000..Selects PMC0 interrupt
 */
#define INPUTMUX0_HIFI4_INTERRUPT_TRIGIN(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_HIFI4_INTERRUPT_TRIGIN_SHIFT)) & INPUTMUX0_HIFI4_INTERRUPT_TRIGIN_MASK)
/*! @} */

/*! @name FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG - LP_FLEXCOMM Input Connections */
/*! @{ */

