Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_INPUTMUX0.h
#define INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_MASK (0xFU)
#define INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - LP_FLEXCOMM Input Trigger
 *  0b0000..Selects CTIMER_C_INP0
 *  0b0001..Selects CTIMER_C_INP1
 *  0b0010..Selects CTIMER_C_INP2
 *  0b0011..Selects CTIMER_C_INP3
 *  0b0100..Selects SCT0_OUT3
 *  0b0101..Selects SCT0_OUT6
 *  0b0110..Selects SCT0_OUT9
 *  0b0111..Selects CTIMER0_MAT3
 *  0b1000..Selects CTIMER1_MAT3
 *  0b1001..Selects CTIMER2_MAT3
 *  0b1010..Selects CTIMER3_MAT3
 *  0b1011..Selects CTIMER4_MAT3
 *  0b1100..Selects PINT0 boolean pattern-match output
 *  0b1101..Selects ACMP0 CMPO
 *  0b1110..Selects RTC_SS0 interrupt
 */
#define INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG */
#define INPUTMUX0_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_COUNT (14U)

/*! @name CTIMER_CTIMER_CAP_CAP - CTIMER Input Connections */
/*! @{ */

#define INPUTMUX0_CTIMER_CTIMER_CAP_CAP_CAPIN_MASK (0x1FU)
#define INPUTMUX0_CTIMER_CTIMER_CAP_CAP_CAPIN_SHIFT (0U)
/*! CAPIN - CTIMER input capture
 *  0b00000..Selects CTIMER_C_INP0
 *  0b00001..Selects CTIMER_C_INP1
 *  0b00010..Selects CTIMER_C_INP2
 *  0b00011..Selects CTIMER_C_INP3
 *  0b00100..Selects CTIMER_C_INP4
 *  0b00101..Selects CTIMER_C_INP5
 *  0b00110..Selects CTIMER_C_INP6
 *  0b00111..Selects CTIMER_C_INP7
 *  0b01000..Selects CTIMER_C_INP8
 *  0b01001..Selects CTIMER_C_INP9
 *  0b01010..Selects CTIMER_C_INP10
 *  0b01011..Selects CTIMER_C_INP11
 *  0b01100..Selects CTIMER_C_INP12
 *  0b01101..Selects CTIMER_C_INP13
 *  0b01110..Selects CTIMER_C_INP14
 *  0b01111..Selects CTIMER_C_INP15
 *  0b10000..Selects SAI0_TX_SYNC
 *  0b10001..Selects SAI0_RX_SYNC
 *  0b10010..Selects SAI1_TX_SYNC
 *  0b10011..Selects SAI1_RX_SYNC
 *  0b10100..Selects SAI2_TX_SYNC
 *  0b10101..Selects SAI2_RX_SYNC
 *  0b10110..Selects USB0 start of frame
 *  0b10111..Selects USB1 start of frame
 *  0b11000..Selects ACMP0 CMPO
 *  0b11001..Selects ADC0 trigger completion flag 0
 *  0b11010..Selects ADC0 trigger completion flag 1
 *  0b11011..Selects ITRC TMPR_OUT[0]
 *  0b11100..Selects ITRC TMPR_OUT[1]
 */
#define INPUTMUX0_CTIMER_CTIMER_CAP_CAP_CAPIN(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_CTIMER_CTIMER_CAP_CAP_CAPIN_SHIFT)) & INPUTMUX0_CTIMER_CTIMER_CAP_CAP_CAPIN_MASK)
/*! @} */

/* The count of INPUTMUX0_CTIMER_CTIMER_CAP_CAP */
#define INPUTMUX0_CTIMER_CTIMER_CAP_CAP_COUNT    (5U)

/* The count of INPUTMUX0_CTIMER_CTIMER_CAP_CAP */
#define INPUTMUX0_CTIMER_CTIMER_CAP_CAP_COUNT2   (4U)

/*! @name CTIMER_TRIG - CTIMER Input Connections */
/*! @{ */

#define INPUTMUX0_CTIMER_TRIG_TRIGIN_MASK        (0x1FU)
#define INPUTMUX0_CTIMER_TRIG_TRIGIN_SHIFT       (0U)
/*! TRIGIN - CTIMER Input Trigger
 *  0b00000..Selects CTIMER_C_INP0
 *  0b00001..Selects CTIMER_C_INP1
 *  0b00010..Selects CTIMER_C_INP2
 *  0b00011..Selects CTIMER_C_INP3
 *  0b00100..Selects CTIMER_C_INP4
 *  0b00101..Selects CTIMER_C_INP5
 *  0b00110..Selects CTIMER_C_INP6
 *  0b00111..Selects CTIMER_C_INP7
 *  0b01000..Selects CTIMER_C_INP8
 *  0b01001..Selects CTIMER_C_INP9
 *  0b01010..Selects CTIMER_C_INP10
 *  0b01011..Selects CTIMER_C_INP11
 *  0b01100..Selects CTIMER_C_INP12
 *  0b01101..Selects CTIMER_C_INP13
 *  0b01110..Selects CTIMER_C_INP14
 *  0b01111..Selects CTIMER_C_INP15
 *  0b10000..Selects SAI0_TX_SYNC
 *  0b10001..Selects SAI0_RX_SYNC
 *  0b10010..Selects SAI1_TX_SYNC
 *  0b10011..Selects SAI1_RX_SYNC
 *  0b10100..Selects SAI2_TX_SYNC
 *  0b10101..Selects SAI2_RX_SYNC
 *  0b10110..Selects USB0 start of frame
 *  0b10111..Selects USB1 start of frame
 *  0b11000..Selects ACMP0 CMPO
 *  0b11001..Selects ADC0 trigger completion flag 0
 *  0b11010..Selects ADC0 trigger completion flag 1
 *  0b11011..Selects ITRC TMPR_OUT[0]
 *  0b11100..Selects ITRC TMPR_OUT[1]
 */
#define INPUTMUX0_CTIMER_TRIG_TRIGIN(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_CTIMER_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_CTIMER_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX0_CTIMER_TRIG */
#define INPUTMUX0_CTIMER_TRIG_COUNT              (5U)

/*! @name FREQ_MEASURE_FREQME_TRIG - FREQME Clock Selection */
/*! @{ */

#define INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_TRIGIN_MASK (0x1FU)
#define INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - FREQME Input Clock
 *  0b00000..Selects main crystal oscillator
 *  0b00001..Selects FRO1_DIV8
 *  0b00010..Selects FRO1
 *  0b00011..Selects LPOSC
 *  0b00100..Selects OSC32KNP osc32k_out
 *  0b00110..Selects FRO0
 *  0b00111..Selects FRO2
 *  0b01000..Selects FREQME_GPIO_A_CLK
 *  0b01001..Selects FREQME_GPIO_B_CLK
 */
#define INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_TRIGIN(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX0_FREQ_MEASURE_FREQME_TRIG */
#define INPUTMUX0_FREQ_MEASURE_FREQME_TRIG_COUNT (2U)

/*! @name EZH_TRIG_EZHV_TRIG - EZH-V Input Connections */
/*! @{ */

#define INPUTMUX0_EZH_TRIG_EZHV_TRIG_TRIGIN_MASK (0x7FU)
#define INPUTMUX0_EZH_TRIG_EZHV_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - EZH-V Input Trigger
 *  0b0000000..Selects GPIO0 peripheral output channel 0 trigger
 *  0b0000001..Selects GPIO0 peripheral output channel 1 trigger
 *  0b0000010..Selects GPIO1 peripheral output channel 0 trigger
 *  0b0000011..Selects GPIO1 peripheral output channel 1 trigger
 *  0b0000100..Selects GPIO2 peripheral output channel 0 trigger
 *  0b0000101..Selects GPIO2 peripheral output channel 1 trigger
 *  0b0000110..Selects GPIO3 peripheral output channel 0 trigger
 *  0b0000111..Selects GPIO3 peripheral output channel 1 trigger
 *  0b0001000..Selects GPIO4 peripheral output channel 0 trigger
 *  0b0001001..Selects GPIO4 peripheral output channel 1 trigger
 *  0b0001010..Selects GPIO5 peripheral output channel 0 trigger
 *  0b0001011..Selects GPIO5 peripheral output channel 1 trigger
 *  0b0001100..Selects GPIO6 peripheral output channel 0 trigger
 *  0b0001101..Selects GPIO6 peripheral output channel 1 trigger
 *  0b0001110..Selects GPIO7 peripheral output channel 0 trigger
 *  0b0001111..Selects GPIO7 peripheral output channel 1 trigger
 *  0b0010000..Selects LP_FLEXCOMM0 interrupt
 *  0b0010001..Selects LP_FLEXCOMM1 interrupt
 *  0b0010010..Selects LP_FLEXCOMM2 interrupt
 *  0b0010011..Selects LP_FLEXCOMM3 interrupt
 *  0b0010100..Selects LP_FLEXCOMM4 interrupt
 *  0b0010101..Selects LP_FLEXCOMM5 interrupt
 *  0b0010110..Selects LP_FLEXCOMM6 interrupt
 *  0b0010111..Selects LP_FLEXCOMM7 interrupt
 *  0b0011000..Selects LPSPI14 interrupt
 *  0b0011001..Selects LPSPI16 interrupt
 *  0b0011010..Selects I3C0 interrupt
 *  0b0011011..Selects I3C1 interrupt
 *  0b0011100..Selects I3C2 interrupt
 *  0b0011101..Selects I3C3 interrupt
 *  0b0011110..Selects FLEXIO interrupt
 *  0b0011111..Selects GPIO0 interrupt
 *  0b0100000..Selects GPIO1 interrupt
 *  0b0100001..Selects GPIO2 interrupt
 *  0b0100010..Selects GPIO3 interrupt
 *  0b0100011..Selects GPIO4 interrupt
 *  0b0100100..Selects GPIO5 interrupt
 *  0b0100101..Selects GPIO6 interrupt
 *  0b0100110..Selects GPIO7 interrupt
 *  0b0100111..Selects GPIO8 interrupt
 *  0b0101000..Selects GPIO9 interrupt
 *  0b0101001..Selects GPIO10 interrupt
 *  0b0101010..Selects SCT0 interrupt
 *  0b0101011..Selects CTIMER0 interrupt
 *  0b0101100..Selects CTIMER1 interrupt
 *  0b0101101..Selects CTIMER2 interrupt
 *  0b0101110..Selects CTIMER3 interrupt
 *  0b0101111..Selects CTIMER4 interrupt
 *  0b0110000..Selects CTIMER5 interrupt
 *  0b0110001..Selects CTIMER6 interrupt
 *  0b0110010..Selects CTIMER7 interrupt
 *  0b0110011..Selects UTICK0 interrupt
 *  0b0110100..Selects MRT0 interrupt
 *  0b0110101..Selects RTC0 interrupt
 *  0b0110110..Selects OSTIMER event timer CPU0 wakeup/interrupt
 *  0b0110111..Selects WWDT0 interrupt
 *  0b0111000..Selects WWDT1 interrupt
 *  0b0111001..Selects ADC0 interrupt
 *  0b0111010..Selects ACMP0 interrupt
 *  0b0111011..Selects MICFIL interrupt
 *  0b0111100..Selects MICFIL HWVAD
 *  0b0111101..Selects uSDHC0 interrupt
 *  0b0111110..Selects uSDHC1 interrupt
 *  0b0111111..Selects USB0 interrupt
 *  0b1000000..Selects USB1 interrupt
 *  0b1000001..Selects LCDIF interrupt
 *  0b1000010..Selects VGPU interrupt
 *  0b1000011..Selects eDMA0 channel 0 interrupt
 *  0b1000100..Selects eDMA0 channel 1 interrupt
 *  0b1000101..Selects eDMA0 channel 2 interrupt
 *  0b1000110..Selects eDMA0 channel 3 interrupt
 *  0b1000111..Selects eDMA1 channel 0 interrupt
 *  0b1001000..Selects eDMA1 channel 1 interrupt
 *  0b1001001..Selects eDMA1 channel 2 interrupt
 *  0b1001010..Selects eDMA1 channel 3 interrupt
 *  0b1001011..Selects eDMA2 channel 0 interrupt
 *  0b1001100..Selects eDMA2 channel 1 interrupt
 *  0b1001101..Selects eDMA2 channel 2 interrupt
 *  0b1001110..Selects eDMA2 channel 3 interrupt
 *  0b1001111..Selects eDMA3 channel 0 interrupt
 *  0b1010000..Selects eDMA3 channel 1 interrupt
 *  0b1010001..Selects eDMA3 channel 2 interrupt
 *  0b1010010..Selects eDMA3 channel 3 interrupt
 *  0b1010011..Selects HiFi1 TIE_EXPSTATE_1
 *  0b1010100..Selects HiFi4 TIE_EXPSTATE_1
 *  0b1010101..Selects SCT0_OUT8
 *  0b1010110..Selects SCT0_OUT9
 *  0b1010111..Selects CTIMER4_MAT3
 *  0b1011000..Selects CTIMER4_MAT2
 *  0b1011001..Selects CTIMER3_MAT3
 *  0b1011010..Selects CTIMER3_MAT2
 *  0b1011011..Selects CPU0 TXEV
 *  0b1011100..Selects PINT0 boolean pattern-match output
 *  0b1011101..Selects MIPI_DSI_HOST interrupt
 *  0b1011110..Selects USB0 start of frame
 *  0b1011111..Selects USB1 start of frame
 *  0b1100000..Selects ITRC TMPR_OUT[0]
 *  0b1100001..Selects ITRC TMPR_OUT[1]
 */
#define INPUTMUX0_EZH_TRIG_EZHV_TRIG_TRIGIN(x)   (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_EZH_TRIG_EZHV_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_EZH_TRIG_EZHV_TRIG_TRIGIN_MASK)
/*! @} */

