Masmiseim36/nxpSDK/devices/MIMXRT758S/periph/PERI_INPUTMUX0.h
/* The count of INPUTMUX0_EZH_TRIG_EZHV_TRIG */
#define INPUTMUX0_EZH_TRIG_EZHV_TRIG_COUNT       (8U)

/*! @name FLEXIO_TRIG - FLEXIO Input Connections */
/*! @{ */

#define INPUTMUX0_FLEXIO_TRIG_TRIGIN_MASK        (0x3FU)
#define INPUTMUX0_FLEXIO_TRIG_TRIGIN_SHIFT       (0U)
/*! TRIGIN - FLEXIO Input Trigger
 *  0b000000..Selects CTIMER_C_INP0
 *  0b000001..Selects CTIMER_C_INP1
 *  0b000010..Selects CTIMER_C_INP2
 *  0b000011..Selects CTIMER_C_INP3
 *  0b000100..Selects SCT0_OUT6
 *  0b000101..Selects SCT0_OUT7
 *  0b000110..Selects SCT0_OUT8
 *  0b000111..Selects CTIMER0_MAT3
 *  0b001000..Selects CTIMER1_MAT3
 *  0b001001..Selects CTIMER2_MAT3
 *  0b001010..Selects CTIMER3_MAT3
 *  0b001011..Selects CTIMER4_MAT3
 *  0b001100..Selects PINT0 boolean pattern-match output
 *  0b001101..Selects ACMP0 CMPO
 *  0b001111..Selects RTC_SS0 interrupt
 *  0b010000..Selects GPIO0 peripheral output channel 0 trigger
 *  0b010001..Selects GPIO0 peripheral output channel 1 trigger
 *  0b010010..Selects GPIO1 peripheral output channel 0 trigger
 *  0b010011..Selects GPIO1 peripheral output channel 1 trigger
 *  0b010100..Selects GPIO2 peripheral output channel 0 trigger
 *  0b010101..Selects GPIO2 peripheral output channel 1 trigger
 *  0b010110..Selects GPIO3 peripheral output channel 0 trigger
 *  0b010111..Selects GPIO3 peripheral output channel 1 trigger
 *  0b011000..Selects GPIO4 peripheral output channel 0 trigger
 *  0b011001..Selects GPIO4 peripheral output channel 1 trigger
 *  0b011010..Selects GPIO5 peripheral output channel 0 trigger
 *  0b011011..Selects GPIO5 peripheral output channel 1 trigger
 *  0b011100..Selects GPIO6 peripheral output channel 0 trigger
 *  0b011101..Selects GPIO6 peripheral output channel 1 trigger
 *  0b011110..Selects GPIO7 peripheral output channel 0 trigger
 *  0b011111..Selects GPIO7 peripheral output channel 1 trigger
 *  0b100000..Selects GPIO8 peripheral output channel 0 trigger
 *  0b100001..Selects GPIO8 peripheral output channel 1 trigger
 *  0b100010..Selects GPIO9 peripheral output channel 0 trigger
 *  0b100011..Selects GPIO9 peripheral output channel 1 trigger
 *  0b100100..Selects GPIO10 peripheral output channel 0 trigger
 *  0b100101..Selects GPIO10 peripheral output channel 1 trigger
 *  0b100110..Selects ITRC TMPR_OUT[0]
 *  0b100111..Selects ITRC TMPR_OUT[1]
 */
#define INPUTMUX0_FLEXIO_TRIG_TRIGIN(x)          (((uint32_t)(((uint32_t)(x)) << INPUTMUX0_FLEXIO_TRIG_TRIGIN_SHIFT)) & INPUTMUX0_FLEXIO_TRIG_TRIGIN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group INPUTMUX0_Register_Masks */


/*!
 * @}
 */ /* end of group INPUTMUX0_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_INPUTMUX0_H_ */

